config.org
#+TITLE: Emacs Configuration File
#+AUTHOR: Matthew Lyon
#+BABEL: :cache yes
#+PROPERTY: header-args :tangle yes

* About
This is my Emacs configuration file written in [[http://orgmode.org][Org mode]]. I have decided to move
away from [[http://spacemacs.org][Spacemacs]] or [[https://github.com/hlissner/.emacs.d][doom-emacs]] towards a custom configuration, and
documenting my config in Org in a /literate/ fashion seems like the way to go.

** TODO Yaks to Shave:
*** Emacs management
    - Update package
    - remove unneded packages
*** TODO UI
    set the font
*** TODO lisp-mode, paredit, etc
*** TODO Elisp Stuff
*** TODO Clojure Mode
** On Emacs vs. Vim, and Evil mode vs. Holy mode.

Years ago, I used vim.  I wrote code mostly in dynamically-typed,
interpreted languages, working on projects of a scale for which I
could keep their structure in my head.  In some cases, I made this into
an argument for microservices.

Then I worked on a fairly large Scala project, and needed something
more.  The project lead wanted me to use IntelliJ, but Spacemacs was
relatively new at the time and I thought I'd give that and Ensime a
try.  It was eons better than vim for working on that type of project.

I grew to like spacemacs, primarily for the which-key
functionality.  That's the sort of thing you just can't do in vim
without hacking it to pieces.  And then I found magit.  And
org-mode.  And fell in love with lisp.

Don't get me wrong, Tim Pope is an amazingly talented plugin author,
and NeoVim is making good strides, but for me it's too little, too
late.  Emacs is light years ahead of vim for many things in the same
way that vim is light years ahead of Notepad.

The stereotypes are true in both directions though: Stock Emacs has
some utterly crap ergonomics.  Yeah, I've mapped Caps-Lock to Control;
I even used to make that remapping a requirement of co-workers who
wanted terminal help.  Where Emacs provides a better *environment* for
editing text, vim provides a better *methodology* for doing so.  Modal
editing, the motion/object grammar, and leader keys are concepts I
wish would seep into more software aimed at power-users.

Here's where Emacs truly shines though: Things like Evil-mode, Hydra,
and which-key help carry those ergonomic ideas forward in ways you
simply can't do in vim.  Spacemacs nailed this.

* Literate Emacs configuration with Org

  The included =init.el= file should, after the first run, mirror the source
  blocks in =init.org=.  Running =org-babel-tangle= will extract the code blocks
  from the file into a source-specific file, in this case an =.el= file. 

  #+BEGIN_SRC emacs-lisp
    (defvar mattly|config-location
      (expand-file-name (concat user-emacs-directory "config.org")))
  #+END_SRC

#+BEGIN_SRC emacs-lisp
  (defun tangle-init ()
    "If the current buffer is 'init.org' the code-blocks are tangled, and the
    tangled file is compiled."
    (when (equal (buffer-file-name) mattly|config-location)
      ;; Avoid running hooks when tangling
      (let ((prog-mode-hook nil))
        (org-babel-tangle)
        (byte-compile-file (concat user-emacs-directory "config.el")))))

  (add-hook 'after-save-hook 'tangle-init)
#+END_SRC

* Bootstrapping Package Management
  The =package= package is included with Emacs 24 and newer. Tell it where to
  find packages, and initialize it.
  #+BEGIN_SRC emacs-lisp
    (require 'package)
    (setq package-archives
          '(("melpa" . "https://melpa.org/packages/")
            ("gnu" . "https://elpa.gnu.org/packages/")
            ("org"   . "http://orgmode.org/elpa/")))
    (package-initialize)
  #+END_SRC

** use-package
  When reading about how other people manage their own Emacs config, the
  top thing people seem to be happiest with is switching to
  [[https://github.com/jwiegley/use-package][use-package]].  In vim-land, I used my own [[https://github.com/mattly/bork][bork]] project to manage vim
  plugins and never got into the many plugin managers that were becoming
  vogue when I switched away, and I don't have any experience with
  managing Emacs packages outside of Spacemacs, so I'm going to trust
  people on this.  =use-package= seems nice from what I've seen.
  
  If it's not installed, we need to install it, and then we need to make
  sure it's installed.
  #+BEGIN_SRC emacs-lisp
    (unless (package-installed-p 'use-package)
            (package-refresh-contents)
            (package-install 'use-package))

    (eval-when-compile
      (require 'use-package))

    (use-package try :ensure t)
  #+END_SRC

  Ensure all packages are installed; if they are not, go and get
  them.  This configuration is stored in version control and used on
  multiple machines, and we shouldn't have to think about whether or not
  we've installed them on a particular one.
  #+BEGIN_SRC emacs-lisp
    (setq use-package-always-ensure t)
  #+END_SRC

** updating packages
   #+BEGIN_SRC emacs-lisp
     (use-package auto-package-update
       :config
       (setq auto-package-update-delete-old-versions t))
   #+END_SRC
* Sanitizing Emacs
** Changing Defaults
   
   I'm not a fan of most of the Emacs defaults.  Thankfully, I don't have to be.
   
   First of all, let's use UTF-8 everywhere.  It's 2017, for crying out loud.
   #+BEGIN_SRC emacs-lisp
     (when (fboundp 'set-charset-priority)
       (set-charset-priority 'unicode))
     (prefer-coding-system 'utf-8)
     (set-terminal-coding-system 'utf-8)
     (set-keyboard-coding-system 'utf-8)
     (set-selection-coding-system 'utf-8)
     (setq locale-coding-system 'utf-8)
     (setq-default buffer-file-coding-system 'utf-8)
   #+END_SRC
   
   Disable the splash screen
   #+BEGIN_SRC emacs-lisp
     (setq inhibit-startup-message t
           inhibit-startup-echo-area-message user-login-name
           inhibit-default-init t
           initial-major-mode 'text-mode
           initial-scratch-message "Welcome to mattlymacs")
   #+END_SRC
   
   Some variables are buffer-local, and sanity is achieved with =setq-default=:
   #+BEGIN_SRC emacs-lisp
     (setq-default fill-column 80)  ; line-width for auto format, warnings, etc
   #+END_SRC
   
   I'm not a fan of Customize, or the noise it generates.
   #+BEGIN_SRC emacs-lisp
     (setq custom-file (concat user-emacs-directory "custom.el"))
     (load custom-file t)
   #+END_SRC
   
** Local Directories
   Some places to keep things
   #+BEGIN_SRC emacs-lisp
     (defvar mattlymacs-dir (expand-file-name user-emacs-directory)
       "The path to the emacs.d directory")

     (defvar mattlymacs-local-dir (concat mattlymacs-dir ".local/")
       "Root directory for local Emacs files. Use this as storage for files that
        are safe to share across computers.")

     (defvar mattlymacs-cache-dir (concat mattlymacs-dir "cache/")
       "Volatile storage. We can write a function to purge it. It shouldn't be in
       source control.")

     (defvar mattlymacs-packages-dir (concat mattlymacs-dir "packages/")
       "Where package.el plugins are stored.")

     (setq-default
      abbrev-file-name (concat mattlymacs-local-dir "abbrev.el")
      auto-save-list-file-name (concat mattlymacs-cache-dir "autosave")
      backup-directory-alist (list (cons "." (concat mattlymacs-cache-dir "backup/")))
      pcache-directory (concat mattlymacs-cache-dir "pcache/"))
   #+END_SRC
** Programming Helpers
   The included =cl-lib= module contains many functions from common lisp.  Quite
   frankly, I'm not very clear yet on where common lisp ends and emacs begins.
   #+BEGIN_SRC emacs-lisp
     (require 'cl-lib)
   #+END_SRC
   
** Initialization Hooks

   #+BEGIN_SRC emacs-lisp
     (defvar mattlymacs-init-hook nil
       "A list of hooks to run when initialized")

     (defun mattly|initialize ()
       (run-hooks 'mattlymacs-init-hook))   

     (add-hook 'emacs-startup-hook #'mattly|initialize)
   #+END_SRC

   #+BEGIN_SRC emacs-lisp
     (defun mattly|find-dotfile ()
       "Edit `init.org' int he current window"
       (interactive)
       (find-file-existing mattly|config-location))

   #+END_SRC

   #+BEGIN_SRC emacs-lisp
     (defun mattly|reload-init ()
       (interactive)
       (load-file "init.el")
       (mattly|initialize))
   #+END_SRC
   
** Package Improvements
*** which-key
    =which-key= might be one of the best new things in power-user interfaces to
    come along in years.  Having all the commands in the word available at your
    fingertips is great, but without a good discoverability mechanism it doesn't
    do much good.
    #+BEGIN_SRC emacs-lisp
      (use-package which-key
	:commands (which-key-mode)
	:diminish t
	:init (which-key-mode)
	:config
	(setq which-key-sort-order 'which-key-key-order-alpha
	      which-key-idle-delay 0.25))
    #+END_SRC

*** hydra
    =hydra= is =which-key='s beautiful companion.  There are some recipes to crib
    on the [[https://github.com/abo-abo/hydra/wiki][wiki]].
    #+BEGIN_SRC emacs-lisp
      (use-package hydra)
    #+END_SRC

* User Interface
** Emacs Settings
  First, set some things
  #+BEGIN_SRC emacs-lisp
    (fset #'yes-or-no-p #'y-or-n-p) ; y/n instead of yes/no

    (setq-default
     bidi-display-reordering nil ; disable bidirectional text for tiny performance boost
     blink-matching-paren nil    ; don't blink--too distracting
     cursor-in-non-selected-windows nil  ; hide cursors in other windows
     frame-inhibit-implied-resize t
     ;; remove continuation arrow on right fringe
     fringe-indicator-alist (delq (assq 'continuation fringe-indicator-alist)
                                  fringe-indicator-alist)
     highlight-nonselected-windows nil
     indicate-buffer-boundaries nil
     indicate-empty-lines nil
     max-mini-window-height 0.3
     mode-line-default-help-echo nil ; disable mode-line mouseovers
     split-width-threshold nil       ; favor horizontal splits
     uniquify-buffer-name-style 'forward
     use-dialog-box nil              ; always avoid GUI
     visible-cursor nil
     x-stretch-cursor nil
     ;; defer jit font locking slightly to [try to] improve Emacs performance
     jit-lock-defer-time nil
     jit-lock-stealth-nice 0.1
     jit-lock-stealth-time 0.2
     jit-lock-stealth-verbose nil
     ;; `pos-tip' defaults
     pos-tip-internal-border-width 6
     pos-tip-border-width 1
     ;; no beeping or blinking please
     ring-bell-function #'ignore
     visible-bell nil)

  #+END_SRC
  
  Kill some GUI annoyances
  #+BEGIN_SRC emacs-lisp
    (tooltip-mode -1) ; relegates tooltips to the echo area
    (menu-bar-mode -1)
    (when (fboundp 'tool-bar-mode)
      (tool-bar-mode -1))
    (when (fboundp 'scroll-bar-mode)
      (scroll-bar-mode -1))
  #+END_SRC
  
** Operating System Basics
   I mostly use emacs on macOS, but that might change in the near future. I'd
   rather not bake in the assumption.
   #+BEGIN_SRC emacs-lisp
     (defconst IS-MAC   (eq system-type 'darwin))
     (defconst IS-LINUX (eq system-type 'gnu/linux))
   #+END_SRC
   
