config.el

(defvar mattly|config-location
  (expand-file-name (concat user-emacs-directory "config.org")))

(defun tangle-init ()
  "If the current buffer is 'init.org' the code-blocks are tangled, and the
  tangled file is compiled."
  (when (equal (buffer-file-name) mattly|config-location)
    ;; Avoid running hooks when tangling
    (let ((prog-mode-hook nil))
      (org-babel-tangle)
      (byte-compile-file (concat user-emacs-directory "config.el")))))

(add-hook 'after-save-hook 'tangle-init)

(require 'package)
(setq package-archives
      '(("melpa" . "https://melpa.org/packages/")
        ("gnu" . "https://elpa.gnu.org/packages/")
        ("org"   . "http://orgmode.org/elpa/")))
(package-initialize)

(unless (package-installed-p 'use-package)
        (package-refresh-contents)
        (package-install 'use-package))

(eval-when-compile
  (require 'use-package))

(use-package try :ensure t)

(setq use-package-always-ensure t)

(use-package auto-package-update
  :config
  (setq auto-package-update-delete-old-versions t))

(when (fboundp 'set-charset-priority)
  (set-charset-priority 'unicode))
(prefer-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(setq locale-coding-system 'utf-8)
(setq-default buffer-file-coding-system 'utf-8)

(setq inhibit-startup-message t
      inhibit-startup-echo-area-message user-login-name
      inhibit-default-init t
      initial-major-mode 'text-mode
      initial-scratch-message "Welcome to mattlymacs")

(setq-default fill-column 80)  ; line-width for auto format, warnings, etc

(setq custom-file (concat user-emacs-directory "custom.el"))
(load custom-file t)

(defvar mattlymacs-dir (expand-file-name user-emacs-directory)
  "The path to the emacs.d directory")

(defvar mattlymacs-local-dir (concat mattlymacs-dir ".local/")
  "Root directory for local Emacs files. Use this as storage for files that
   are safe to share across computers.")

(defvar mattlymacs-cache-dir (concat mattlymacs-dir "cache/")
  "Volatile storage. We can write a function to purge it. It shouldn't be in
  source control.")

(defvar mattlymacs-packages-dir (concat mattlymacs-dir "packages/")
  "Where package.el plugins are stored.")

(setq-default
 abbrev-file-name (concat mattlymacs-local-dir "abbrev.el")
 auto-save-list-file-name (concat mattlymacs-cache-dir "autosave")
 backup-directory-alist (list (cons "." (concat mattlymacs-cache-dir "backup/")))
 pcache-directory (concat mattlymacs-cache-dir "pcache/"))

(require 'cl-lib)

(defvar mattlymacs-init-hook nil
  "A list of hooks to run when initialized")

(defun mattly|initialize ()
  (run-hooks 'mattlymacs-init-hook))   

(add-hook 'emacs-startup-hook #'mattly|initialize)

(defun mattly|find-dotfile ()
  "Edit `init.org' int he current window"
  (interactive)
  (find-file-existing mattly|config-location))

(defun mattly|reload-init ()
  (interactive)
  (load-file "init.el")
  (mattly|initialize))

(use-package which-key
  :commands (which-key-mode)
  :diminish t
  :init (which-key-mode)
  :config
  (setq which-key-sort-order 'which-key-key-order-alpha
        which-key-idle-delay 0.25))

(use-package hydra)

(fset #'yes-or-no-p #'y-or-n-p) ; y/n instead of yes/no

(setq-default
 bidi-display-reordering nil ; disable bidirectional text for tiny performance boost
 blink-matching-paren nil    ; don't blink--too distracting
 cursor-in-non-selected-windows nil  ; hide cursors in other windows
 frame-inhibit-implied-resize t
 ;; remove continuation arrow on right fringe
 fringe-indicator-alist (delq (assq 'continuation fringe-indicator-alist)
                              fringe-indicator-alist)
 highlight-nonselected-windows nil
 indicate-buffer-boundaries nil
 indicate-empty-lines nil
 max-mini-window-height 0.3
 mode-line-default-help-echo nil ; disable mode-line mouseovers
 split-width-threshold nil       ; favor horizontal splits
 uniquify-buffer-name-style 'forward
 use-dialog-box nil              ; always avoid GUI
 visible-cursor nil
 x-stretch-cursor nil
 ;; defer jit font locking slightly to [try to] improve Emacs performance
 jit-lock-defer-time nil
 jit-lock-stealth-nice 0.1
 jit-lock-stealth-time 0.2
 jit-lock-stealth-verbose nil
 ;; `pos-tip' defaults
 pos-tip-internal-border-width 6
 pos-tip-border-width 1
 ;; no beeping or blinking please
 ring-bell-function #'ignore
 visible-bell nil)

(tooltip-mode -1) ; relegates tooltips to the echo area
(menu-bar-mode -1)
(when (fboundp 'tool-bar-mode)
  (tool-bar-mode -1))
(when (fboundp 'scroll-bar-mode)
  (scroll-bar-mode -1))

(defconst IS-MAC   (eq system-type 'darwin))
(defconst IS-LINUX (eq system-type 'gnu/linux))

(when IS-MAC
