config.org
** Macintosh Setup
   These seem to be the defaults on [[https://bitbucket.org/mituharu/emacs-mac/overview][RailwayCat's Emacs-mac]], but I prefer to be
   explicit when possible.
   #+BEGIN_SRC emacs-lisp
     (when IS-MAC
       (setq mac-command-modifier 'meta
             mac-option-modifier 'alt)
       (when (require 'osx-clipboard nil t)))
         ;; (osx-clipboard-mode +1)))
   #+END_SRC

** Font
   Iosevka is really nice.
   #+BEGIN_SRC emacs-lisp
     (defvar mattly-font "Iosevka Light 14")
     (set-face-attribute 'default nil :font mattly-font)
     (set-frame-font mattly-font nil t)
   #+END_SRC
  
*** Text Scaling
    #+BEGIN_SRC emacs-lisp
      (use-package zoom-frm
        :defer t
        :commands (zoom-in zoom-out zoom-in/out zoom-frm-unzoom))
    #+END_SRC
** Theme
   Eventually I'm going to publish this theme.
   #+BEGIN_SRC emacs-lisp
     (add-to-list 'custom-theme-load-path "/Users/mattly/projects/emacs/akkala-theme/")
     (add-to-list 'load-path "/Users/mattly/projects/emacs/akkala-theme/")
     (require 'akkala-themes)
     (load-theme 'akkala-basic)
   #+END_SRC

** Evil Mode
   A necessary evil.  I don't have much to say about this beyond what I said at
   the beginning.  A tidbit at the end of the =:config= section sets up the "correct"
   behavior of focusing the new window when creating a split.
   #+BEGIN_SRC emacs-lisp
     (use-package evil
       :demand t
       :init
       (setq evil-want-C-u-scroll t
             evil-want-visual-char-semi-exclusive t
             evil-want-Y-yank-to-eol t
             evil-magic t
             evil-echo-state t
             evil-indent-convert-tabs t
             evil-ex-search-vim-style-regexp t
             evil-ex-substitute-global t
             evil-ex-visual-char-range t
             evil-insert-skip-empty-lines t
             evil-mode-line-format 'nil
             evil-symbol-word-search t
             shift-select-mode nil)
       :config
       (evil-mode +1)
       (evil-select-search-module 'evil-search-module 'evil-search)
       (defun +evil*window-follow (&rest _)  (evil-window-down 1))
       (defun +evil*window-vfollow (&rest _) (evil-window-right 1))
       (advice-add #'evil-window-split  :after #'+evil*window-follow)
       (advice-add #'evil-window-vsplit :after #'+evil*window-vfollow))
   #+END_SRC
  
** Key Binding Helpers (General)
   I'm defining this here instead of the key bindings section, so I can very
   easily elsewhere in this config handle one-off bindings for small packages as
   they come up.

   [[https://github.com/noctuid/general.el][general.el]] isn't quite my dream DSL for binding keys, but it turns out that
   keybindings in emacs with evil is a pretty complex topic.  You've got various
   states & modes to worry about, mode maps, common prefixes, etc.  And it
   handles those all pretty well.
   #+BEGIN_SRC emacs-lisp
     (use-package general
       :commands (general-create-definer)
       :config
       (general-evil-setup t))
   #+END_SRC

*** Binding Helpers
    These binding helpers are useful for defining bindings with common options
    in multiple places, so I don't have to define everything at one or track down
    common options in multiple places.

    =bind-at-rest= makes bindings in normal & visual mode without a prefix, to
    accompany such vim stalwarts as =i= and =w=. They are bound to keymaps
    instead of states, because other modes (such as magit) might provide their
    own bindings on these keys and I don't want to override those.

    #+BEGIN_SRC emacs-lisp
      (general-create-definer bind-navigation
                              :keymaps '(evil-normal-state-map evil-visual-state-map evil-motion-state-map)) 
      (general-create-definer bind-motion
                              :keymaps '(evil-motion-state-map)) 
      (general-create-definer bind-operator
                              :keymaps '(evil-operator-state-map))
      (general-create-definer bind-inner-object
                              :keymaps '(evil-inner-text-objects-map))
      (general-create-definer bind-outer-object
                              :keymaps '(evil-outer-text-objects-map))
    #+END_SRC

    =bind-main-menu= makes bindings for the global menu system on =SPC= for
    at-rest modes, or in insert/emacs mode with =M-S-SPC=.
    #+BEGIN_SRC emacs-lisp
      (general-create-definer bind-main-menu
                              :prefix "SPC"
                              :non-normal-prefix "M-S-SPC"
                              :keymaps 'global
                              :states '(normal visual operator insert emacs))
    #+END_SRC

    =bind-mode-menu= makes a binding for the major-mode-specific menu system on
    =,= for at-rest modes or =M-S-,= for insert mode.
    #+BEGIN_SRC emacs-lisp
      (general-create-definer bind-mode-menu
                              :prefix ","
                              :states '(normal visual))
    #+END_SRC
** evil Plugins 
*** evil-commentary
    Automatically sets up =gc= and =gcc= similar to the vim plugin, also provides:

    - =gy= :: yanks (copies) the uncommented code, and comments the motion out
    - =s-/= :: comments out the current line, similar to =gcc=
   #+BEGIN_SRC emacs-lisp
     (use-package evil-commentary
       :commands (evil-commentary evil-commentary-yank evil-commentary-line)
       :diminish t
       :config
       (evil-commentary-mode 1))
   #+END_SRC
** Resetting Evil
   #+BEGIN_SRC emacs-lisp
     (setcdr evil-normal-state-map nil)
     (setcdr evil-visual-state-map nil)
     (setcdr evil-motion-state-map nil)
     (setcdr evil-operator-state-map nil)
   #+END_SRC
* Editor Niceties
** Recent Files
   Keep track of recent files
   #+BEGIN_SRC emacs-lisp
     (use-package recentf
       :config
       (setq recentf-max-menu-items 0
             recentf-save-file (concat mattlymacs-cache-dir "recentf")
             recentf-max-saved-items 300
             recentf-exclude (list "^/tmp" "^/ssh:" "^/var/folders/.+$"
                                   "\\.?ido\\.last$" "\\.revive$" "/TAGS$"))
       (recentf-mode 1))
   #+END_SRC

** Completion (Counsel, Ivy)

   #+BEGIN_SRC emacs-lisp
     (use-package counsel
       :diminish t
       :ensure t)

     (use-package ivy
       :ensure t
       :diminish t
       :init (ivy-mode 1)
       :config
       (setq ivy-use-virtual-buffers t
             ivy-height 20
             ivy-count-format "(%d/%d) ")) 

     (use-package all-the-icons-ivy
       :diminish t
       :config
       (all-the-icons-ivy-setup))
   #+END_SRC

** Text Manipulation
*** Folding
    #+BEGIN_SRC emacs-lisp
      (use-package origami
        :diminish t
        :defer t
        :config
        (setq origami-show-fold-header t)
        (global-origami-mode))
    #+END_SRC
*** Whitespace
    #+BEGIN_SRC emacs-lisp
      (setq-default indent-tabs-mode nil
                    whitespace-mode nil
                    require-final-newline nil)

      (use-package ethan-wspace
        :defer t
        :diminish t
        :config
        (global-ethan-wspace-mode 1))
    #+END_SRC

*** Delimiters

**** SmartParens
     #+BEGIN_SRC emacs-lisp
       (use-package smartparens
         :defer t
         :commands (sp-split-sexp sp-newline sp-up-sexp)
         :init
         (setq sp-autowrap-region nil ; let others handle this
               sp-highlight-pair-overlay t
               sp-cancel-autoskip-on-backward-movement nil
               sp-show-pair-delay 0.2
               sp-show-pair-from-inside t)
         :config
         (require 'smartparens-config)
         (add-hook 'prog-mode-hook #'smartparens-mode)
         ;; sp interferes with replace-mode
         (add-hook 'evil-replace-state-entry-hook #'turn-off-smartparens-mode)
         (add-hook 'evil-replace-state-exit-hook #'turn-on-smartparens-mode)

         (sp-local-pair 'minibuffer-inactive-mode "'" nil :actions nil))
     #+END_SRC

**** Rainbow Delimiters
     #+BEGIN_SRC emacs-lisp
       (use-package rainbow-delimiters
         :defer t
         :init
         (add-hook 'prog-mode-hook #'rainbow-delimiters-mode))
     #+END_SRC

**** Highlight Parens
     #+BEGIN_SRC emacs-lisp
       (use-package highlight-parentheses
         :defer t
         :init
         (progn
           (add-hook 'prog-mode-hook #'highlight-parentheses-mode)
           (setq hl-paren-delay 0.2)
           (setq hl-paren-colors '("Springgreen3"
                                   "IndianRed1"
                                   "IndianRed3"
                                   "IndianRed4")))
         :config
         (set-face-attribute 'hl-paren-face nil :weight 'ultra-bold))
     #+END_SRC
*** Inflections
    kebab-case is the one true case.  kebab-case loves you.  Every other case hates
    you and wants you to suffer RSI.
    #+BEGIN_SRC emacs-lisp
      (use-package string-inflection
        :defer t
        :diminish t)
    #+END_SRC

** In-Buffer Navigation
   I'm just trying out avy for now.
   #+BEGIN_SRC emacs-lisp
     (use-package avy
       :config
       (setq avy-keys '(?a ?r ?s ?t ?n ?e ?i ?o)))
   #+END_SRC
** Miscellany
*** $EDITOR for child processes
    #+BEGIN_SRC emacs-lisp
      (use-package with-editor
        :defer t)

      (bind-mode-menu
       :keymaps 'with-editor-mode-map
       "," '(with-editor-finish :which-key "finish")
       "a" '(with-editor-cancel :which-key "cancel")
       "c" '(with-editor-finish :which-key "finish")
       "k" '(with-editor-cancel :which-key "cancel"))
    #+END_SRC
*** Fill Column Indicator
    #+BEGIN_SRC emacs-lisp
      (use-package fill-column-indicator
        :defer t
        :commands (fci-mode))
    #+END_SRC
*** Restarting
    Handy package for easy-peasy restarts when you need them.
    #+BEGIN_SRC emacs-lisp
      (use-package restart-emacs
        :defer t)
     #+END_SRC

* Project Management
