config.el
  (setq mac-command-modifier 'meta
        mac-option-modifier 'alt)
  (when (require 'osx-clipboard nil t)))
    ;; (osx-clipboard-mode +1)))

(defvar mattly-font "Iosevka Light 14")
(set-face-attribute 'default nil :font mattly-font)
(set-frame-font mattly-font nil t)

(use-package zoom-frm
  :defer t
  :commands (zoom-in zoom-out zoom-in/out zoom-frm-unzoom))

(add-to-list 'custom-theme-load-path "/Users/mattly/projects/emacs/akkala-theme/")
(add-to-list 'load-path "/Users/mattly/projects/emacs/akkala-theme/")
(require 'akkala-themes)
(load-theme 'akkala-basic)

(use-package evil
  :demand t
  :init
  (setq evil-want-C-u-scroll t
        evil-want-visual-char-semi-exclusive t
        evil-want-Y-yank-to-eol t
        evil-magic t
        evil-echo-state t
        evil-indent-convert-tabs t
        evil-ex-search-vim-style-regexp t
        evil-ex-substitute-global t
        evil-ex-visual-char-range t
        evil-insert-skip-empty-lines t
        evil-mode-line-format 'nil
        evil-symbol-word-search t
        shift-select-mode nil)
  :config
  (evil-mode +1)
  (evil-select-search-module 'evil-search-module 'evil-search)
  (defun +evil*window-follow (&rest _)  (evil-window-down 1))
  (defun +evil*window-vfollow (&rest _) (evil-window-right 1))
  (advice-add #'evil-window-split  :after #'+evil*window-follow)
  (advice-add #'evil-window-vsplit :after #'+evil*window-vfollow))

(use-package general
  :commands (general-create-definer)
  :config
  (general-evil-setup t))

(general-create-definer bind-navigation
                        :keymaps '(evil-normal-state-map evil-visual-state-map evil-motion-state-map)) 
(general-create-definer bind-motion
                        :keymaps '(evil-motion-state-map)) 
(general-create-definer bind-operator
                        :keymaps '(evil-operator-state-map))
(general-create-definer bind-inner-object
                        :keymaps '(evil-inner-text-objects-map))
(general-create-definer bind-outer-object
                        :keymaps '(evil-outer-text-objects-map))

(general-create-definer bind-main-menu
                        :prefix "SPC"
                        :non-normal-prefix "M-S-SPC"
                        :keymaps 'global
                        :states '(normal visual operator insert emacs))

(general-create-definer bind-mode-menu
                        :prefix ","
                        :states '(normal visual))

(use-package evil-commentary
  :commands (evil-commentary evil-commentary-yank evil-commentary-line)
  :diminish t
  :config
  (evil-commentary-mode 1))

;; (setcdr evil-normal-state-map nil)
;; (setcdr evil-visual-state-map nil)
;; (setcdr evil-motion-state-map nil)
(setcdr evil-operator-state-map nil)

(use-package recentf
  :config
  (setq recentf-max-menu-items 0
        recentf-save-file (concat mattlymacs-cache-dir "recentf")
        recentf-max-saved-items 300
        recentf-exclude (list "^/tmp" "^/ssh:" "^/var/folders/.+$"
                              "\\.?ido\\.last$" "\\.revive$" "/TAGS$"))
  (recentf-mode 1))

(use-package counsel
  :diminish t
  :ensure t)

(use-package ivy
  :ensure t
  :diminish t
  :init (ivy-mode 1)
  :config
  (setq ivy-use-virtual-buffers t
        ivy-height 20
        ivy-count-format "(%d/%d) ")) 

(use-package all-the-icons-ivy
  :diminish t
  :config
  (all-the-icons-ivy-setup))

(use-package origami
  :diminish t
  :defer t
  :config
  (setq origami-show-fold-header t)
  (global-origami-mode))

(use-package smartparens
  :defer t
  :commands (sp-split-sexp sp-newline sp-up-sexp)
  :diminish t
  :init
  (setq sp-autowrap-region nil ; let others handle this
        sp-highlight-pair-overlay t
        sp-cancel-autoskip-on-backward-movement nil
        sp-show-pair-delay 0.2
        sp-show-pair-from-inside t)
  :config
  (require 'smartparens-config)
  (add-hook 'prog-mode-hook #'smartparens-mode)
  ;; sp interferes with replace-mode
  (add-hook 'evil-replace-state-entry-hook #'turn-off-smartparens-mode)
  (add-hook 'evil-replace-state-exit-hook #'turn-on-smartparens-mode)

  (sp-local-pair 'minibuffer-inactive-mode "'" nil :actions nil))

(setq-default indent-tabs-mode nil
              whitespace-mode nil
              require-final-newline nil)

(use-package ethan-wspace
  :defer t
  :diminish t
  :config
  (global-ethan-wspace-mode 1))



(use-package string-inflection
  :defer t
  :diminish t)

(use-package avy)

(use-package with-editor
  :defer t)

(bind-mode-menu
 :keymaps 'with-editor-mode-map
 "," '(with-editor-finish :which-key "finish")
 "a" '(with-editor-cancel :which-key "cancel")
 "c" '(with-editor-finish :which-key "finish")
 "k" '(with-editor-cancel :which-key "cancel"))

(use-package fill-column-indicator
  :defer t
  :commands (fci-mode))

(use-package restart-emacs
  :defer t)
