config.org
** Projectile
   One of my first big gripes when moving to Emacs from vim was, I was used to working with
   per-project vim instances under tmux, so buffers were naturally isolated based on where
   the vim instance was created from.

   Working in the Emacs GUI, you don't really have that.  Buffers are shared across all frames,
   and if you tend to have multiple projects open (as I do), it can get confusing quickly.

   [[https://github.com/bbatsov/projectile][Projectile]] aims to fix that.
   #+BEGIN_SRC emacs-lisp
     (use-package projectile
       :demand t
       :diminish t
       :init
       (setq
        projectile-cache-file (concat mattlymacs-cache-dir "projectile.cache")
        projectile-completion-system 'ivy
        projectile-enable-caching (not noninteractive)
        projectile-globally-ignored-directories `(,mattlymacs-local-dir ".sync")
        projectile-globally-ignored-file-suffixes '(".elc")
        projectile-globally-ignored-files '(".DS_Store")
        projectile-indexing-method 'alien
        projectile-known-projects-file (concat mattlymacs-cache-dir "projectile.projects")
        projectile-project-root-files
        '(".git" ".hg" ".project" "package.json"))
       :config
       (add-hook 'mattlymacs-init-hook #'projectile-mode))

   #+END_SRC

** Source Control: Git and Magit
   Sure, I could use mercurial or perforce, but what would that get me? Git is
   it, and [[https://magit.vc][Magit]] is pretty awesome.  I used to prefer the git command line, and 
   came up with all sorts of pithy aliases in my [[https://github.com/mattly/dotfiles/blob/master/configs/gitconfig#L46][gitconfig]] to handle common
   operations.  I had stockholm syndrome for git's poor user interface.  
   #+BEGIN_SRC emacs-lisp
     (use-package magit
       :commands (magit-status magit-list-repositories)
       :config
       (setq magit-display-buffer-function 'magit-display-buffer-fullframe-status-v1
             magit-completing-read-function 'ivy-completing-read))
   #+END_SRC

*** Evil for Magit
    I still want evil-bindings everywhere, though.
    #+BEGIN_SRC emacs-lisp
      ;; (use-package evil-magit
      ;;   :init
      ;;   (with-eval-after-load 'magit
      ;;     (require 'evil-magit)))
    #+END_SRC
    
    #+BEGIN_SRC emacs-lisp
      (general-define-key
       :keymaps
       '(magit-mode-map
         magit-status-mode-map
         magit-file-section-map
         magit-unstaged-section-map
         magit-staged-section-map
         magit-refs-mode-map
         magit-blame-mode-map
         magit-hunk-section-map
         magit-diff-mode-map
         magit-log-read-revs-map
         magit-log-mode-map
         magit-log-select-mode-map
         magit-cherry-mode-map
         magit-reflog-mode-map
         magit-process-mode-map
         magit-stash-mode-map)
       "i" 'magit-section-forward-sibling
       "e" 'magit-section-forward
       "n" 'magit-section-backward-sibling
       "u" 'magit-section-backward
       "j" 'magit-unstage
       "J" 'magit-unstage-all)

      (with-eval-after-load 'magit
        (magit-change-popup-key 'magit-dispatch-popup :actions (string-to-char "u") (string-to-char "j"))
        (magit-change-popup-key 'magit-dispatch-popup :actions (string-to-char "U") (string-to-char "J")))
    #+END_SRC

*** Committing
    Best practices for git commits are: 50 character subject lines, separate the
    body with a blank line, and wrap the body at 72 characters. I can enforce those.
    Things like capitalization, imperative in the subject, explain _what_ and
    _why_ vs. _how_, I can't enforce so much.
    #+BEGIN_SRC emacs-lisp
      (use-package git-commit
        :defer t
        :config
        (add-hook 'git-commit-mode-hook #'fci-mode))
    #+END_SRC

*** Git Files (.gitignore, .gitcommit)
    #+BEGIN_SRC emacs-lisp
      (use-package gitattributes-mode
        :defer t)
      (use-package gitconfig-mode
        :defer t)
      (use-package gitignore-mode
        :defer t)
    #+END_SRC
* Lisp
  People who complain about the abundance of parenthesis in lisps miss the
  point.  In over two years of working primarily with lisps full-time, the only
  times I've had to think about managing parenthesis manually was when I was
  making a small edit to something in the GitHub editor or the like.  And sure,
  I usually screw it up.  But the whole point of having parenthesis and spaces
  as your primary syntax delimiters is to enable _structural editing_, a
  powerful idea and practice that's difficult to execute well in languages which
  complicate their syntax away from its strucutre.
  
  If you use an auto-close or auto-pair style plugin, that automatically inserts
  a closing paren, bracket, quote, or such, or highlights its compliement, you 
  already practice a weak form of structural editing -- the editor knows that 
  certain characters form nodes in a syntax tree, and helps to both ensure the
  integrity of that tree and highlight its structure.  Structural editing is that,
  but much more powerful.
  
** Lisp Mode
   #+BEGIN_SRC emacs-lisp
     (defvar lisp-mode-hook nil)
     "A list of hooks to run when entering a lisp mode."

     (defun run-lisp-mode-hook ()
       (run-hooks 'lisp-mode-hook))
   #+END_SRC
  
** Parinfer
   As an initial experiment, I'm seeing how far I can get with the lighter
   weight [[https://shaunlebron.github.io/parinfer/][Parinfer]] before I feel the need to add something a bit heavier.  I used
   parinfer solely when trying out Atom briefly, and while I feel Atom has a long
   way to go before it's really usable for me, I did quite like parinfer.

   #+BEGIN_SRC emacs-lisp
     (use-package parinfer
       :ensure t
       :init
       (progn
         (setq parinfer-extensions
               '(defaults
                  pretty-parens
                  evil
                  smart-yank))
         (add-hook 'lisp-mode-hook #'parinfer-mode)))
   #+END_SRC


* Key Bindings
** At-Rest (Normal & Visual) immediate mappings
   I'm basically mucking with the vim bindings here.
*** Reset
    #+BEGIN_SRC emacs-lisp
      (bind-navigation
       "?" 'which-key-show-top-level)
    #+END_SRC
*** Navigation
    #+BEGIN_SRC emacs-lisp
      ;; (define-key evil-operator-state-map "i" nil)
      (bind-navigation
       "l" 'evil-backward-char
       "u" 'evil-previous-line
       "y" 'evil-forward-char

       "e" 'evil-next-line
       "n" 'evil-backward-word-begin
       "i" 'evil-forward-word-begin
       "o" 'evil-forward-word-end

       "k" 'evil-find-char
       "K" 'evil-find-char-to

       "L" 'back-to-indentation
       "U" 'evil-backward-paragraph
       "Y" 'evil-end-of-line

       "E" 'evil-forward-paragraph
       "N" 'evil-backward-sentence-begin
       "I" 'evil-forward-sentence-begin
       "O" 'evil-forward-WORD-end

       "j" 'evil-scroll-page-up
       "h" 'evil-scroll-page-down
       "J" 'evil-goto-first-line
       "H" 'evil-goto-line

       "'" 'avy-goto-char-2
       "/" '(swiper :which-key "swiper"))

      (define-key evil-operator-state-map "r" evil-inner-text-objects-map)
      (define-key evil-operator-state-map "s" evil-outer-text-objects-map)

    #+END_SRC
*** Modification
    #+BEGIN_SRC emacs-lisp
      (bind-navigation
       "r" 'evil-insert
       "R" 'evil-insert-line
       "s" 'evil-append
       "S" 'evil-append-line
       "t" 'evil-change
       "T" 'evil-change-line
       "q" 'evil-replace
       "Q" 'evil-replace-state
       "z" 'evil-open-below
       "Z" 'evil-open-above
       "d" 'evil-delete
       "D" 'evil-delete-line

       "p" 'undo-tree-undo
       "P" 'undo-tree-redo

       "x" 'evil-delete-char
       "X" 'evil-delete-line
       "c" 'evil-yank
       "C" 'evil-yank-line
       "v" 'evil-paste-after
       "V" 'evil-paste-before

       "a" 'evil-visual-char
       "A" 'evil-visual-line
       "C-a" 'evil-visual-block)
    #+END_SRC
*** Et Cetera
    #+BEGIN_SRC emacs-lisp
      (bind-navigation
       "TAB" '(origami-recursively-toggle-node :which-key "toggle this fold recursively (like org)")
       "M-=" '(zoom-in :which-key "zoom in")
       "M--" '(zoom-out :which-key "zoom out")
       "M-x" '(counsel-M-x :which-key "counsel-M-x"))
    #+END_SRC

** Menu System
   The spacemacs menu-system is one of the best new things I've seen in an
   editor in a long time.  This is my copy.

*** Top-Level
    #+BEGIN_SRC emacs-lisp
      (bind-main-menu
       "/" '(counsel-rg :which-key "search in current directory")
       "TAB" '(ivy-switch-buffer :which-key "ivy buffer")
       "SPC" '(counsel-M-x :which-key "M-x"))
    #+END_SRC

*** b is for Buffer
    #+BEGIN_SRC emacs-lisp
      (bind-main-menu
       :infix "b"
       "" '(:ignore t :which-key "buffer")
       "b" '(ivy-switch-buffer :which-key "switch")
       "d" '(evil-delete-buffer :which-key "delete")
       "D" '(kill-buffer-and-window :which-key "delete buffer & window"))
    #+END_SRC

*** f is for Files
    #+BEGIN_SRC emacs-lisp
      (bind-main-menu
       :infix "f"
       "" '(:ignore t :which-key "file")
       "D" '(delete-file :which-key "delete (any file)")
       "f" '(counsel-find-file :which-key "find file")
       "r" '(counsel-recentf :which-key "recent files")
       "R" '(rename-file :which-key "rename (any file)")
       "s" '(save-buffer :which-key "save"))
    #+END_SRC

*** g is for Git
    I feel a bit bad about this, maybe it should be under =v= for Version
    Control? But I mean, I haven't touched another VCS aside from just toying
    around in like 8 years. So git it is.
    #+BEGIN_SRC emacs-lisp
      (bind-main-menu
       :infix "g"
       "" '(:ignore t :which-key "git")
       "b" '(magit-blame :which-key "blame")
       "f" '(counsel-git :which-key "find file")
       "g" '(counsel-git-grep :which-key "git grep")
       "s" '(magit-status :which-key "status"))
    #+END_SRC

*** h is for Help
    #+BEGIN_SRC emacs-lisp
      (bind-main-menu
       :infix "h"
       "" '(:ignore t :which-key "help")
       "f" '(counsel-describe-function :which-key "describe function")
       "F" '(counsel-describe-face :which-key "describe face")
       "k" '(describe-key :which-key "describe key")
       "v" '(counsel-describe-variable :which-key "describe variable"))
    #+END_SRC

*** p is for Project
    #+BEGIN_SRC emacs-lisp
      (bind-main-menu
       :infix "p"
       "" '(:ignore t :which-key "project")
       "b" '(projectile-switch-to-buffer :which-key "switch buffer")
       "f" '(projectile-find-file :which-key "find file")
       "p" '(projectile-switch-project :which-key "switch project")
       "r" '(projectile-recentf :which-key "recent files")
       "x" '(projectile-invalidate-cache :which-key "invalidate cache"))
    #+END_SRC

*** q is for Quitters
    #+BEGIN_SRC emacs-lisp
      (bind-main-menu
       :infix "q"
       "" '(:ignore t :which-key "quit")
       "r" '(restart-emacs :which-key "restart")
       "q" '(evil-save-and-quit :which-key "quit and save"))
    #+END_SRC

