config.el

(use-package projectile
  :demand t
  :diminish t
  :init
  (setq
   projectile-cache-file (concat mattlymacs-cache-dir "projectile.cache")
   projectile-completion-system 'ivy
   projectile-enable-caching (not noninteractive)
   projectile-globally-ignored-directories `(,mattlymacs-local-dir ".sync")
   projectile-globally-ignored-file-suffixes '(".elc")
   projectile-globally-ignored-files '(".DS_Store")
   projectile-indexing-method 'alien
   projectile-known-projects-file (concat mattlymacs-cache-dir "projectile.projects")
   projectile-project-root-files
   '(".git" ".hg" ".project" "package.json"))
  :config
  (add-hook 'mattlymacs-init-hook #'projectile-mode))

(use-package magit
  :commands (magit-status magit-list-repositories)
  :config
  (setq magit-display-buffer-function 'magit-display-buffer-fullframe-status-v1
        magit-completing-read-function 'ivy-completing-read))

(use-package evil-magit
  :init
  (with-eval-after-load 'magit
    (require 'evil-magit)))

(use-package git-commit
  :defer t
  :config
  (add-hook 'git-commit-mode-hook #'fci-mode))

(use-package gitattributes-mode
  :defer t)
(use-package gitconfig-mode
  :defer t)
(use-package gitignore-mode
  :defer t)

(use-package parinfer
  :ensure t
  :init
  (progn
    (setq parinfer-extensions
          '(defaults
             pretty-parens
             evil
             smart-yank))
    (add-hook 'emacs-lisp-mode-hook #'parinfer-mode)))

(use-package lispy)
(use-package evil-lispy)

(add-hook 'emacs-lisp-mode-hook #'evil-lispy-mode)

;; (define-key evil-operator-state-map "i" nil)
(bind-navigation
 "l" 'evil-backward-char
 "u" 'evil-previous-line
 "y" 'evil-forward-char

 "e" 'evil-next-line
 "n" 'evil-backward-word-begin
 "i" 'evil-forward-word-begin

 "L" 'back-to-indentation
 "U" 'evil-backward-paragraph
 "Y" 'evil-end-of-line

 "N" 'evil-backward-sentence-begin
 "I" 'evil-forward-sentence-begin
 "E" 'evil-forward-paragraph

 "j" 'evil-scroll-page-up
 "h" 'evil-scroll-page-down)

(define-key evil-operator-state-map "r" evil-inner-text-objects-map)
(define-key evil-operator-state-map "s" evil-outer-text-objects-map)

(bind-navigation
 "r" 'evil-insert
 "R" 'evil-insert-line
 "s" 'evil-append
 "S" 'evil-append-line
 "t" 'evil-change
 "T" 'evil-change-line
 "q" 'evil-replace
 "Q" 'evil-replace-state
 "z" 'evil-open-below
 "Z" 'evil-open-above

 "d" 'evil-delete
 "D" 'evil-delete-line

 "p" 'undo-tree-undo
 "P" 'undo-tree-redo

 "x" 'evil-delete-char
 "X" 'evil-delete-line
 "c" 'evil-yank
 "C" 'evil-yank-line
 "v" 'evil-paste-after
 "V" 'evil-paste-before)

(bind-navigation
 "TAB" '(origami-recursively-toggle-node :which-key "toggle this fold recursively (like org)")
 "/" '(swiper :which-key "swiper")
 "M-=" '(zoom-in :which-key "zoom in")
 "M--" '(zoom-out :which-key "zoom out")
 "M-x" '(counsel-M-x :which-key "counsel-M-x"))

(bind-main-menu
 "/" '(counsel-rg :which-key "search in current directory")
 "TAB" '(ivy-switch-buffer :which-key "ivy buffer")
 "SPC" '(counsel-M-x :which-key "M-x"))

(bind-main-menu
 :infix "b"
 "" '(:ignore t :which-key "buffer")
 "b" '(ivy-switch-buffer :which-key "switch")
 "d" '(evil-delete-buffer :which-key "delete")
 "D" '(kill-buffer-and-window :which-key "delete buffer & window"))

(bind-main-menu
 :infix "f"
 "" '(:ignore t :which-key "file")
 "D" '(delete-file :which-key "delete (any file)")
 "f" '(counsel-find-file :which-key "find file")
 "r" '(counsel-recentf :which-key "recent files")
 "R" '(rename-file :which-key "rename (any file)")
 "s" '(save-buffer :which-key "save"))

(bind-main-menu
 :infix "g"
 "" '(:ignore t :which-key "git")
 "b" '(magit-blame :which-key "blame")
 "f" '(counsel-git :which-key "find file")
 "g" '(counsel-git-grep :which-key "git grep")
 "s" '(magit-status :which-key "status"))

(bind-main-menu
 :infix "h"
 "" '(:ignore t :which-key "help")
 "f" '(counsel-describe-function :which-key "describe function")
 "F" '(counsel-describe-face :which-key "describe face")
 "k" '(describe-key :which-key "describe key")
 "v" '(counsel-describe-variable :which-key "describe variable"))

(bind-main-menu
 :infix "p"
 "" '(:ignore t :which-key "project")
 "b" '(projectile-switch-to-buffer :which-key "switch buffer")
 "f" '(projectile-find-file :which-key "find file")
 "p" '(projectile-switch-project :which-key "switch project")
 "r" '(projectile-recentf :which-key "recent files")
 "x" '(projectile-invalidate-cache :which-key "invalidate cache"))

(bind-main-menu
 :infix "q"
 "" '(:ignore t :which-key "quit")
 "r" '(restart-emacs :which-key "restart")
 "q" '(evil-save-and-quit :which-key "quit and save"))
