config.org
*** t is for Toggles
    I'm using a hydra for this because I can make it show me if a toggle is
    enabled or not.
    #+BEGIN_SRC emacs-lisp
      (defhydra mattly-toggles (:color pink)
        "
      _f_ fill column indicator:   %`fci-mode
      _F_ auto line breaking:      %`auto-fill-function
      _p_ smartparens:             %`smartparens-mode
      _w_ whitespace display:      %`whitespace-mode
      "
        ("f" fci-mode nil)
        ("F" auto-fill-mode nil)
        ("p" smartparens-mode nil)
        ("w" whitespace-mode nil)
        ("q" nil "cancel"))

      (bind-main-menu
       "t" '(mattly-toggles/body :which-key "toggles"))
    #+END_SRC

*** u is for User Interface
    #+BEGIN_SRC emacs-lisp
      (bind-main-menu
       :infix "u"
       "-" '(zoom-out :which-key "zoom out")
       "=" '(zoom-in :which-key "zoom in")
       "0" '(zoom-frm-unzoom :which-key "zoom reset"))
    #+END_SRC
*** w is for Windows
    The vim/emacs notion of a window, that is. What you'd call a "pane" or
    "split" in a more modern program.
    #+BEGIN_SRC emacs-lisp
      (bind-main-menu
       :infix "w"
       "" '(:ignore t :which-key "window")
       "u" '(evil-window-up :which-key "go window up")
       "e" '(evil-window-down :which-key "go window down")
       "n" '(evil-window-left :which-key "go window left")
       "i" '(evil-window-right :which-key "go window right")
       "m" '(:ignore t :which-key "move")
       "m u" '(evil-window-move-very-top :which-key "window far top")
       "m e" '(evil-window-move-very-bottom :which-key "window far bottom")
       "m n" '(evil-window-move-far-left :which-key "window far left")
       "m i" '(evil-window-move-far-right :which-key "window far right")
       "s" '(evil-window-split :which-key "split left")
       "v" '(evil-window-vsplit :which-key "split below")
       "d" '(evil-window-delete :which-key "delete window"))
    #+END_SRC

*** x is for Text
    OK this one is a bit of a stretch. At least the letter is in the item? And
    I'm used to it from spacemacs.
    #+BEGIN_SRC emacs-lisp
      (bind-main-menu
       :infix "x"
       "" '(:ignore t :which-key "text")
       "i" '(:ignore t :which-key "inflection")
       "i c" '(string-inflection-lower-camelcase :which-key "camelCase")
       "i C" '(string-inflection-camelcase :which-key "CamelCase")
       "i -" '(string-inflection-kebab-case :which-key "kebab-case")
       "i k" '(string-inflection-kebab-case :which-key "kebab-case")
       "i _" '(string-inflection-underscore :which-key "under_score") ;; you hate me
       "i u" '(string-inflection-underscore :which-key "under_score") ;; why do you hate me?
       "i U" '(string-inflection-upcase :which-key "UP_CASE")) ;; oh right you think `-` is math because you have a crap parser.
    #+END_SRC

*** z is for Folding
    This is even more of a stretch. But it ties into existing folding under
    =z=. I'm using a hydra for this because it makes naviation easier.
    #+BEGIN_SRC emacs-lisp
      (defhydra mattly|folding (:color pink)
        "
      Close^^          Open^^           Toggle^^        Goto^^
      -----^^--------- ----^^---------- ------^^------- ----^^----
      _c_: at point    _o_: at point    _a_: at point   _n_: next
      _C_: recursively _O_: recursively _A_: all        _p_: previous
      _m_: all         _r_: all         _TAB_: like org
      "
        ("c" origami-close-node)
        ("C" origami-close-node-recursively)
        ("m" origami-close-all-nodes)
        ("o" origami-open-node)
        ("O" origami-open-node-recursively)
        ("a" origami-forward-toggle-node)
        ("r" origami-open-all-nodes)
        ("A" origami-toggle-all-nodes)
        ("TAB" origami-recursively-toggle-node)
        ("<tab>" origami-recursively-toggle-node)
        ("n" origami-next-fold)
        ("p" origami-previous-fold)
        ("q" nil :exit t)
        ("C-g" nil :exit t)
        ("<SPC>" nil :exit t))

      (bind-main-menu
       "z" '(mattly|folding/body :which-key "folding"))
    #+END_SRC

*** \ is for This Config
    The stretchiest stretch of them all.
    #+BEGIN_SRC emacs-lisp 
      (bind-main-menu
       :infix "\\"
       "" '(:ignore t :which-key "config")
       "d" '(mattly|find-dotfile :which-key "find config.org")
       "p" '(auto-package-update-now :which-key "update packages")
       "r" '(mattly|reload-init :which-key "reload"))
    #+END_SRC
   
   
* Major & Minor Modes (file types, languages, etc)
** Clojure
   #+BEGIN_SRC emacs-lisp
     (use-package clojure-mode
       :defer t
       :init
       (progn
         (add-to-list 'auto-mode-alist '("\\.boot\\'" . clojure-mode))
         (add-to-list 'magic-mode-alist '("#!.*boot\\s-*$" . clojure-mode)))
       :config
       (add-hook 'clojure-mode-hook #'run-lisp-mode-hook))
   #+END_SRC
** Emacs Lisp
   #+BEGIN_SRC emacs-lisp
     (add-hook 'emacs-lisp-mode-hook #'run-lisp-mode-hook)
   #+END_SRC
** Markdown
   #+BEGIN_SRC emacs-lisp
     (use-package markdown-mode
       :defer t)
   #+END_SRC
** Org
   Org is as close to a realization of the editable, interactive, embeddable
   content varietal document as I've seen since Steve Jobs killed OpenDoc back
   in the 90s. Aping that was one of the first things I tried to do as a personal
   project after I first learned how to program something more complicated than a
   shell script. I failed because, well, I wasn't ready yet. Twelve years later,
   I'm still not ready, so I use org-mode.
   #+BEGIN_SRC emacs-lisp
     (use-package org-plus-contrib
       :defer t
       :config
       (sp-with-modes '(org-mode)
         (sp-local-pair "\\[" "\\]" :post-handlers '(("|" "SPC")))
         (sp-local-pair "\\(" "\\)" :post-handlers '(("|" "SPC")))
         (sp-local-pair "$$" "$$" :post-handlers '((:add " | ")) :unless '(sp-point-at-bol-p))
         (sp-local-pair "{" nil)))
   #+END_SRC
*** org packages
**** org-bullets
    Yeah so org-bullets is one of those eye candy things that actually makes it
    feel like you're not really using a forty-year old program. That counts
    for something.
    #+BEGIN_SRC emacs-lisp
      (use-package org-bullets
        :defer t
        :commands (org-bullets-mode)
        :init
        (setq org-bullets-bullet-list '("§" "𝟤" "𝟥" "𝟦" "𝟧" "𝟨" "𝟩" "𝟪" "𝟫"))
        (setq org-bullets-face-name 'org-bullet)
        (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
    #+END_SRC
   
**** org-babel
     What languages do we want org to handle?
     #+BEGIN_SRC emacs-lisp
       (setq org-babel-load-languages '())
       (defvar mattly|org-babel-load-languages
         '(emacs-lisp))
     #+END_SRC

     Babel is included with org, though apparently available as =ob= on the
     (insecure) org repository. Instead of using =use-package= just configure it
     in a function called by the org's =:config= option.
     #+BEGIN_SRC emacs-lisp
       (defun +org|init-babel ()
         (setq org-src-fontify-natively t
               org-src-tab-acts-natively t
               org-src-window-setup 'other-window)

         (org-babel-do-load-languages
          'org-babel-load-languages
          (mapcar (lambda (sym) (cons sym t)) mattly|org-babel-load-languages))

         (add-hook 'org-src-mode-hook
                   (lambda () (when header-line-format (setq header-line-format nil)))))

       (add-hook 'org-mode-hook #'+org|init-babel)
       (add-hook 'mattlymacs-init-hook #'+org|init-babel)
     #+END_SRC

**** org-evil
     =org-evil= defines some [[https://github.com/Somelauw/evil-org-mode/blob/master/doc/keythemes.org][useful key bindings]] and has some duplication with
     the bindings I declare below, but it also has movement by element and
     additional text objects like =e= for an object and =E= for an element.
     #+BEGIN_SRC emacs-lisp
       (use-package org-evil
         :defer t
         :diminish t
         :after org
         :config)
         ;; (add-hook 'org-mode-hook 'evil-org-mode)
         ;; (add-hook 'evil-org-mode-hook
         ;;     (lambda () (evil-org-set-key-theme)))
   
     #+END_SRC
