config.el

(defhydra mattly-toggles (:color pink)
  "
_f_ fill column indicator:   %`fci-mode
_F_ auto line breaking:      %`auto-fill-function
_p_ smartparens:             %`smartparens-mode
_w_ whitespace display:      %`whitespace-mode
"
  ("f" fci-mode nil)
  ("F" auto-fill-mode nil)
  ("p" smartparens-mode nil)
  ("w" whitespace-mode nil)
  ("q" nil "cancel"))

(bind-main-menu
 "t" '(mattly-toggles/body :which-key "toggles"))

(bind-main-menu
 :infix "u"
 "-" '(zoom-out :which-key "zoom out")
 "=" '(zoom-in :which-key "zoom in")
 "0" '(zoom-frm-unzoom :which-key "zoom reset"))

(bind-main-menu
 :infix "w"
 "" '(:ignore t :which-key "window")
 "h" '(evil-window-left :which-key "go left")
 "j" '(evil-window-down :which-key "go down")
 "k" '(evil-window-up :which-key "go up")
 "l" '(evil-window-right :which-key "go right")
 "m" '(:ignore t :which-key "move")
 "m h" '(evil-window-move-far-left :which-key "far left")
 "m j" '(evil-window-move-very-bottom :which-key "far bottom")
 "m k" '(evil-window-move-very-top :which-key "far top")
 "m l" '(evil-window-move-far-right :which-key "far right")
 "s" '(evil-window-split :which-key "split left")
 "v" '(evil-window-vsplit :which-key "split below")
 "d" '(evil-window-delete :which-key "delete"))

(bind-main-menu
 :infix "x"
 "" '(:ignore t :which-key "text")
 "i" '(:ignore t :which-key "inflection")
 "i c" '(string-inflection-lower-camelcase :which-key "camelCase")
 "i C" '(string-inflection-camelcase :which-key "CamelCase")
 "i -" '(string-inflection-kebab-case :which-key "kebab-case")
 "i k" '(string-inflection-kebab-case :which-key "kebab-case")
 "i _" '(string-inflection-underscore :which-key "under_score") ;; you hate me
 "i u" '(string-inflection-underscore :which-key "under_score") ;; why do you hate me?
 "i U" '(string-inflection-upcase :which-key "UP_CASE")) ;; oh right you think `-` is math because you have a crap parser.

(defhydra mattly|folding (:color pink)
  "
Close^^          Open^^           Toggle^^        Goto^^
-----^^--------- ----^^---------- ------^^------- ----^^----
_c_: at point    _o_: at point    _a_: at point   _n_: next
_C_: recursively _O_: recursively _A_: all        _p_: previous
_m_: all         _r_: all         _TAB_: like org
"
  ("c" origami-close-node)
  ("C" origami-close-node-recursively)
  ("m" origami-close-all-nodes)
  ("o" origami-open-node)
  ("O" origami-open-node-recursively)
  ("a" origami-forward-toggle-node)
  ("r" origami-open-all-nodes)
  ("A" origami-toggle-all-nodes)
  ("TAB" origami-recursively-toggle-node)
  ("<tab>" origami-recursively-toggle-node)
  ("n" origami-next-fold)
  ("p" origami-previous-fold)
  ("q" nil :exit t)
  ("C-g" nil :exit t)
  ("<SPC>" nil :exit t))

(bind-main-menu
 "z" '(mattly|folding/body :which-key "folding"))

(bind-main-menu
 :infix "\\"
 "" '(:ignore t :which-key "config")
 "d" '(mattly|find-dotfile :which-key "find init.org")
 "p" '(auto-package-update-now :which-key "update packages")
 "r" '(mattly|reload-init :which-key "reload"))

(use-package org-plus-contrib
  :defer t
  :config
  (sp-with-modes '(org-mode)
    (sp-local-pair "\\[" "\\]" :post-handlers '(("|" "SPC")))
    (sp-local-pair "\\(" "\\)" :post-handlers '(("|" "SPC")))
    (sp-local-pair "$$" "$$" :post-handlers '((:add " | ")) :unless '(sp-point-at-bol-p))
    (sp-local-pair "{" nil)))

(use-package org-bullets
  :defer t
  :commands (org-bullets-mode)
  :init
  (setq org-bullets-bullet-list '("§" "𝟤" "𝟥" "𝟦" "𝟧" "𝟨" "𝟩" "𝟪" "𝟫"))
  (setq org-bullets-face-name 'org-bullet)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

(setq org-babel-load-languages '())
(defvar mattly|org-babel-load-languages
  '(emacs-lisp))

(defun +org|init-babel ()
  (setq org-src-fontify-natively t
        org-src-tab-acts-natively t
        org-src-window-setup 'other-window)

  (org-babel-do-load-languages
   'org-babel-load-languages
   (mapcar (lambda (sym) (cons sym t)) mattly|org-babel-load-languages))

  (add-hook 'org-src-mode-hook
            (lambda () (when header-line-format (setq header-line-format nil)))))

(add-hook 'org-mode-hook #'+org|init-babel)
(add-hook 'mattlymacs-init-hook #'+org|init-babel)

(use-package org-evil
  :defer t
  :diminish t
  :after org
  :config
  ;; (add-hook 'org-mode-hook 'evil-org-mode)
  (add-hook 'evil-org-mode-hook
      (lambda () (evil-org-set-key-theme))))

(general-define-key
 :states '(normal visual operator)
