config.org
*** key bindings
    I was hoping to make an evil-mode similar to spacemacs' =evil-lisp-state=
    but I couldn't figure out how to do it in a way that keeps =which-key= in
    view the way spacemacs does. And, sadly, these operations aren't things I
    have in muscle memory yet, and they won't ever get there without on-screen
    reminders about which-keys I have to press. So, I'm using =hydra= for now,
    which seems to be awesome in its own right.

    - bindings for table editing
    
   #+BEGIN_SRC emacs-lisp
     (general-define-key
      :states '(normal visual operator)
      :keymaps 'org-mode-map
      "RET" 'org-return-indent)

     (bind-mode-menu
      :keymaps 'org-mode-map
      "c" '(org-edit-special :which-key "edit special")
      "d" '(org-insert-drawer :which-key "insert drawer")
      "h" '(org-insert-heading-respect-content :which-key "insert heading after")
      "H" '(org-insert-subheading :which-key "insert subheading here")
      "t" '(org-table-create :which-key "create table"))

     (defhydra mattly|hydra-org-structure (:color pink)
       "
     ^Nav^               ^Subtree^          ^Node^
     ^^^^^^^^^-----------------------------------------------
     _h_: up heading     _H_: promote       _N_: promote
     _j_: next heading   _J_: move down     _P_: demote
     _k_: prev heading   _K_: move up
     _n_: next sibling   _L_: demote
     _p_: prev sibling

     "
       ("h" outline-up-heading)
       ("j" org-next-visible-heading)
       ("k" org-previous-visible-heading)
       ("n" org-forward-heading-same-level)
       ("p" org-backward-heading-same-level)
       ("H" org-promote-subtree)
       ("J" org-move-subtree-down)
       ("K" org-move-subtree-up)
       ("L" org-demote-subtree)
       ("N" org-do-promote)
       ("P" org-do-demote)
       ("q" nil "quit")
       ("ESC" nil "quit"))

     (general-define-key
      :prefix "SPC"
      :states '(normal visual operator)
      :keymaps 'org-mode-map
      "k" '(mattly|hydra-org-structure/body :which-key "org structure"))

     (general-define-key
      :prefix ","
      :states '(normal visual)
      :keymaps 'org-src-mode-map
      "c" '(org-edit-src-exit :which-key "save and exit")
      "," '(org-edit-src-exit :which-key "save and exit")
      "k" '(org-edit-src-abort :which-key "abort and exit"))
  #+END_SRC
